<a href="https://colab.research.google.com/github/dauphin95/data_spring/blob/master/PCA_All_to_csv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#!pip install -U pandas-profiling

In [2]:
import pandas as pd

In [3]:
#import pandas_profiling

In [4]:
df = pd.read_csv('credit_cards_dataset.csv')

In [5]:
df.head(3)

   ID  LIMIT_BAL  SEX  ...  PAY_AMT5  PAY_AMT6  default.payment.next.month
0   1    20000.0    2  ...       0.0       0.0                           1
1   2   120000.0    2  ...       0.0    2000.0                           1
2   3    90000.0    2  ...    1000.0    5000.0                           0

[3 rows x 25 columns]

In [8]:
df.columns

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_0',
       'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default.payment.next.month'],
      dtype='object')

PCA for Pay_Score Bill_Amount Pay_Amount

In [9]:
from sklearn.decomposition import PCA

In [10]:
df_Pay_Score = df[['PAY_0','PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6']]

In [11]:
df_Bill_Amount = df[[ 'BILL_AMT1', 'BILL_AMT2','BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6']]

In [12]:
df_Pay_Amount = df[['PAY_AMT1','PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6']]

In [13]:
df_Pay_Score.head(3)

   PAY_0  PAY_2  PAY_3  PAY_4  PAY_5  PAY_6
0      2      2     -1     -1     -2     -2
1     -1      2      0      0      0      2
2      0      0      0      0      0      0

In [14]:
df_Bill_Amount.head(3)

   BILL_AMT1  BILL_AMT2  BILL_AMT3  BILL_AMT4  BILL_AMT5  BILL_AMT6
0     3913.0     3102.0      689.0        0.0        0.0        0.0
1     2682.0     1725.0     2682.0     3272.0     3455.0     3261.0
2    29239.0    14027.0    13559.0    14331.0    14948.0    15549.0

In [15]:
df_Pay_Amount.head(3)

   PAY_AMT1  PAY_AMT2  PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6
0       0.0     689.0       0.0       0.0       0.0       0.0
1       0.0    1000.0    1000.0    1000.0       0.0    2000.0
2    1518.0    1500.0    1000.0    1000.0    1000.0    5000.0

PCA instance 생성

In [16]:
trans = PCA(n_components=1)

In [17]:
X_Pay_Score = df_Pay_Score.values

In [18]:
X_Bill_Amount = df_Bill_Amount.values

In [19]:
X_Pay_Amount = df_Pay_Amount.values

In [20]:
# transform the data
X_dim = trans.fit_transform(X_Pay_Score)

In [21]:
X_dim.shape

(30000, 1)

In [22]:
df_X_dim_Pay_Score = pd.DataFrame(X_dim, columns=['Pay_AVR'])

In [23]:
# transform the data
X_dim = trans.fit_transform(X_Bill_Amount)

In [24]:
df_X_dim_Bill_Amount = pd.DataFrame(X_dim, columns=['Bill_AVR'])

In [25]:
# transform the data
X_dim = trans.fit_transform(X_Pay_Amount)

In [26]:
df_X_dim_Pay_Amount = pd.DataFrame(X_dim, columns=['P_AMT_AVR'])

목표변수 : default.payment.next.month  Input 데이터 셋: X

In [27]:
df = pd.concat([df, df_X_dim_Pay_Score, df_X_dim_Bill_Amount, df_X_dim_Pay_Amount], axis=1)

In [28]:
df_pca = df.drop(['PAY_0','PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6','BILL_AMT1', 'BILL_AMT2','BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1','PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6'], axis =1)

In [29]:
df_pca.columns

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE',
       'default.payment.next.month', 'Pay_AVR', 'Bill_AVR', 'P_AMT_AVR'],
      dtype='object')

In [30]:
columns = list(df_pca.columns)

In [31]:
columns = ['ID','LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE','Pay_AVR', 'Bill_AVR', 'P_AMT_AVR', 'default.payment.next.month']

In [32]:
df_pca = df_pca[columns]

In [33]:
df_pca.head(3)

   ID  LIMIT_BAL  SEX  ...       Bill_AVR     P_AMT_AVR  default.payment.next.month
0   1    20000.0    2  ... -107289.378431 -11443.690236                           1
1   2   120000.0    2  ... -103860.702650 -10043.014174                           1
2   3    90000.0    2  ...  -68874.738469  -8086.514262                           0

[3 rows x 10 columns]

In [34]:
df_pca.to_csv('credit_cards_pca2.csv',header=True, index=False, encoding='UTF-8')

In [35]:
X = df.drop(['ID','PAY_0','PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6','BILL_AMT1', 'BILL_AMT2','BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1','PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6', 'default.payment.next.month'], axis =1).values